SITE_NAME = "Magazon"

WELCOME_MESSAGE = "📋 Согласны ли вы на обработку Ваших персональных " \
                  "данных и пройти процедуру заполнения анкеты?"

WELCOME_ERROR = f"⚠ Вы не зарегистрированы на сайте {SITE_NAME}"

AGREEMENT = "✅ Согласен"
DENIAL = "❌ Отказываюсь"

AGREEMENT_NO = "⚠ Вы отказались от обработки Ваших персональных данных. " \
               "Дальнейшее оказание услуги не предоставляется возможным."

START = "/start"

USER_PHONE = "🆔 Для регистрации мне понадобится ваши контактные данные"

USER_PHONE_SEND = "☎ Мой номер телефона"

SUCCESSFUL_REG = "Вы успешно зарегистрировались"

SUCCESS_AUTH = f"Телеграм успешно привязан к вашей учётной записи в {SITE_NAME}:"

AUTH_BUTTON = "Вернуться на сайт"
